// --------------------------------------------------------------------------
// 연습: 숫자 값 콘솔 패널에 출력
// --------------------------------------------------------------------------
console.log(5);


// --------------------------------------------------------------------------
// 연습: 문자 값 콘솔 패널에 출력
// --------------------------------------------------------------------------
console.log('Hello');

// --------------------------------------------------------------------------
// 연습: 논리 값 콘솔 패널에 출력
// --------------------------------------------------------------------------
console.log(true);


// --------------------------------------------------------------------------
// 연습: 여러 값 콘솔 패널에 출력
// --------------------------------------------------------------------------
console.log(5, 'Hello', true);

// --------------------------------------------------------------------------
// 연습: 콘솔 패널에 오류 또는 경고 출력
// --------------------------------------------------------------------------
console.error("❌ 문자 값은 따옴표로 묶어 출력하지 않으면 오류입니다");
console.warn("⚠️ Javascript의 데이터를 기억하려면 변수 또는 상수가 필요합니다");
console.info("ℹ️ 터미널 정수의 기능을 다양하게 활용할 수 있습니다");

// --------------------------------------------------------------------------
// 연습: 콘솔 그룹화 출력
// --------------------------------------------------------------------------
// 숫자 (정수)
console.group('숫자 (정수)')
console.log(10)
console.log(101)
console.log(908)
console.groupEnd()

// 숫자 (소수)
console.group('숫자 (소수)')
console.log(0.6)
console.log(0.23)
console.log(0.964)
console.groupEnd()

// --------------------------------------------------------------------------
// 연습: 콘솔 로그에 CSS 설정 추가 (웹 브라우저 콘솔 패널에서 확인 가능)
// --------------------------------------------------------------------------
console.log("%c멋사", "color: pink; background: green; padding: 4px;");
console.log("%c자바스크립트 공부중!", "color: hotpink; font-size: 20px;");
console.log('%c멋사 프론트엔드 부트캠프 16기 여러분 파이팅! 🥧', `
  color: #4285f4;
  font-size: 3rem;
  font-weight: 700;
`)
