// --------------------------------------------------------------------------
// 연습: 다음 정보를 변수와 상수로 저장하고 콘솔에 출력하세요.
// --------------------------------------------------------------------------
// - 이름(상수)
const userName = '한결'
// - 나이(변수)
let userAge = 89
// - 학생 여부(상수)
const isStudent = true
// - 모든 정보를 한 번에 출력해보세요.
console.log(userName);
console.log(userAge);
console.log(isStudent); 



// --------------------------------------------------------------------------
// 연습: 다음 계산을 변수를 사용하여 수행하세요.
// --------------------------------------------------------------------------
// - 숫자1(상수)
const num1 = 3
// - 숫자2(상수)
const num2 = 5
// - 결과(변수)
let result = num1 + num2
console.log(result);


// --------------------------------------------------------------------------
// 연습: 다음 쇼핑 정보를 변수로 관리하세요.
// --------------------------------------------------------------------------
// - 상품명(상수)
const productName = '상품명'
// - 가격(변수)
let productPrice = 98_000
// - 재고 있음(변수)
let productInventory = 102
// - 할인율(상수)
const discountRate = 0.1